{
    "config": {
        "flow_title": "Integración de Xiaomi Home",
        "step": {
            "eula": {
                "title": "Aviso de riesgo",
                "description": "1. Su **información de usuario de Xiaomi e información del dispositivo** se almacenará en su sistema Home Assistant. **Xiaomi no puede garantizar la seguridad del mecanismo de almacenamiento de Home Assistant**. Usted es responsable de evitar que su información sea robada.\r\n2. Esta integración es mantenida por la comunidad de código abierto y puede haber problemas de estabilidad u otros problemas. Cuando tenga problemas relacionados con el uso de esta integración, **busque ayuda en la comunidad de código abierto en lugar de contactar al servicio al cliente de Xiaomi**.\r\n3. Es necesario tener ciertas habilidades técnicas para mantener su entorno de ejecución local, esta integración no es amigable para los usuarios novatos.\r\n4. Antes de utilizar esta integración, por favor **lea detenidamente el archivo README**. \r\n5. Para garantizar el uso estable de la integración y prevenir el abuso de la interfaz, **esta integración solo está permitida en Home Assistant. Para más detalles, consulte la LICENSE**.\r\n",
                "data": {
                    "eula": "He leído y entiendo los riesgos anteriores, y estoy dispuesto a asumir cualquier riesgo relacionado con el uso de esta integración."
                }
            },
            "auth_config": {
                "title": "Configuración básica",
                "description": "### Región de inicio de sesión\r\nSeleccione la región donde se encuentra su cuenta de Xiaomi. Puede consultar esta información en `Xiaomi Home APP > Yo (ubicado en el menú inferior) > Más ajustes > Acerca de Xiaomi Home`.\r\n### Idioma\r\nSeleccione el idioma utilizado para los nombres de los dispositivos y entidades. Las partes de las frases que no están traducidas se mostrarán en inglés.\r\n### Dirección de redireccionamiento de autenticación de OAuth2\r\nLa dirección de redireccionamiento de autenticación de OAuth2 es **[http://homeassistant.local:8123](http://homeassistant.local:8123)**. Home Assistant debe estar en la misma red local que el terminal de operación actual (por ejemplo, una computadora personal) y el terminal de operación debe poder acceder a la página de inicio de Home Assistant a través de esta dirección, de lo contrario, la autenticación de inicio de sesión podría fallar.\r\n### Nota\r\n- Para los usuarios con cientos o más dispositivos Mi Home, la adición inicial de la integración tomará algún tiempo. Por favor, sea paciente.\r\n- Si Home Assistant se está ejecutando en un entorno Docker, asegúrese de que el modo de red de Docker esté configurado en host, de lo contrario, la funcionalidad de control local puede no funcionar correctamente.\r\n- La funcionalidad de control local de la integración tiene algunas dependencias. Por favor, lea el README cuidadosamente.\r\n",
                "data": {
                    "cloud_server": "Región de inicio de sesión",
                    "integration_language": "Idioma",
                    "oauth_redirect_url": "Dirección de redireccionamiento de autenticación de OAuth2"
                }
            },
            "oauth_error": {
                "title": "Error de inicio de sesión",
                "description": "Haga clic en \"Siguiente\" para volver a intentarlo"
            },
            "devices_filter": {
                "title": "Seleccionar hogares y dispositivos",
                "description": "## Instrucciones de uso\r\n### Modo de control\r\n- Automático: Cuando hay un gateway central de Xiaomi disponible en la red local, Home Assistant priorizará el envío de comandos de control de dispositivos a través del gateway central para lograr un control localizado. Si no hay un gateway central en la red local, intentará enviar comandos de control a través del protocolo Xiaomi OT para lograr un control localizado. Solo cuando no se cumplan las condiciones anteriores de control localizado, los comandos de control del dispositivo se enviarán a través de la nube.\r\n- Nube: Los comandos de control solo se envían a través de la nube.\r\n### Hogares de dispositivos importados\r\nLa integración agregará los dispositivos en los hogares seleccionados.\r\n### Modo de sincronización del nombre de la habitación\r\nCuando se sincronizan los dispositivos desde la aplicación Xiaomi Home a Home Assistant, los nombres de las áreas donde se encuentran los dispositivos en Home Assistant seguirán las reglas de nomenclatura a continuación. Tenga en cuenta que el proceso de sincronización de dispositivos no cambiará la configuración de hogares y habitaciones en la aplicación Xiaomi Home.\r\n- Sin sincronización: el dispositivo no se agregará a ninguna área.\r\n- Otras opciones: la zona donde se agrega el dispositivo tendrá el mismo nombre que el hogar o la habitación en la aplicación Xiaomi Home.\r\n### Modo de depuración de Action\r\nPara los métodos definidos por MIoT-Spec-V2, además de generar una entidad de notificación, también se generará una entidad de cuadro de entrada de texto que se puede utilizar para enviar comandos de control al dispositivo durante la depuración.\r\n### Ocultar entidades generadas no estándar\r\nOcultar las entidades generadas por la instancia no estándar MIoT-Spec-V2 que comienzan con \"*\".\r\n\r\n&emsp;\r\n### ¡Hola, {nick_name}! Seleccione el modo de control de integración y el hogar donde se encuentran los dispositivos que desea agregar.\r\n",
                "data": {
                    "ctrl_mode": "Modo de control",
                    "home_infos": "Hogares de dispositivos importados",
                    "area_name_rule": "Modo de sincronización del nombre de la habitación",
                    "action_debug": "Modo de depuración de Action",
                    "hide_non_standard_entities": "Ocultar entidades generadas no estándar"
                }
            }
        },
        "progress": {
            "oauth": "### {link_left}Haga clic aquí para iniciar sesión de nuevo{link_right}\r\n(Será redirigido automáticamente a la siguiente página después de un inicio de sesión exitoso)"
        },
        "error": {
            "eula_not_agree": "Lea el texto de aviso de riesgo.",
            "get_token_error": "Error al obtener la información de autorización de inicio de sesión (token OAuth).",
            "get_homeinfo_error": "Error al obtener la información del hogar.",
            "mdns_discovery_error": "Error en el servicio de descubrimiento de dispositivos locales.",
            "get_cert_error": "Error al obtener el certificado de la puerta de enlace.",
            "no_family_selected": "No se ha seleccionado ningún hogar.",
            "no_devices": "No hay dispositivos en el hogar seleccionado. Seleccione un hogar con dispositivos y continúe.",
            "no_central_device": "【Modo de puerta de enlace central】Se requiere una puerta de enlace Xiaomi disponible en la red local donde se encuentra Home Assistant. Verifique si el hogar seleccionado cumple con este requisito."
        },
        "abort": {
            "network_connect_error": "La configuración ha fallado. Existe un problema con la conexión de red, verifique la configuración de red del dispositivo.",
            "already_configured": "Esta cuenta ya ha finalizado la configuración. Ingrese a la página de integración y haga clic en el botón \"Configurar\" para modificar la configuración.",
            "invalid_auth_info": "La información de autorización ha caducado. Ingrese a la página de integración y haga clic en el botón \"Configurar\" para volver a autenticarse.",
            "config_flow_error": "Error de configuración de integración: {error}"
        }
    },
    "options": {
        "step": {
            "auth_config": {
                "title": "Configuración de autorización",
                "description": "Se detectó que la información de autenticación local ha caducado, vuelva a autenticarse\r\n### Región de inicio de sesión actual: {cloud_server}\r\n### Dirección de redireccionamiento de autenticación de OAuth2\r\nLa dirección de redireccionamiento de autenticación de OAuth2 es **[http://homeassistant.local:8123](http://homeassistant.local:8123)**. Home Assistant debe estar en la misma red local que el terminal de operación actual (por ejemplo, una computadora personal) y el terminal de operación debe poder acceder a la página de inicio de Home Assistant a través de esta dirección, de lo contrario, la autenticación de inicio de sesión podría fallar.\r\n",
                "data": {
                    "oauth_redirect_url": "Dirección de redireccionamiento de autenticación de OAuth2"
                }
            },
            "oauth_error": {
                "title": "Error de inicio de sesión",
                "description": "Haga clic en \"Siguiente\" para volver a intentarlo\r\n"
            },
            "config_options": {
                "title": "Opciones de configuración",
                "description": "### ¡Hola, {nick_name}!\r\n\r\nID de cuenta de Xiaomi: {uid}\r\nRegión de inicio de sesión actual: {cloud_server}\r\n\r\nSeleccione las opciones que desea reconfigurar y haga clic en \"Siguiente\".\r\n",
                "data": {
                    "integration_language": "Idioma de la integración",
                    "update_user_info": "Actualizar información de usuario",
                    "update_devices": "Actualizar lista de dispositivos",
                    "action_debug": "Modo de depuración de Action",
                    "hide_non_standard_entities": "Ocultar entidades generadas no estándar",
                    "update_trans_rules": "Actualizar reglas de conversión de entidad (configuración global)",
                    "update_lan_ctrl_config": "Actualizar configuración de control LAN (configuración global)"
                }
            },
            "update_user_info": {
                "title": "Actualizar apodo de usuario",
                "description": "¡Hola, {nick_name}! Modifique su apodo de usuario a continuación.\r\n",
                "data": {
                    "nick_name": "Apodo de usuario"
                }
            },
            "devices_filter": {
                "title": "Recomendar hogares y dispositivos",
                "description": "## Instrucciones de uso\r\n### Modo de control\r\n- Automático: Cuando hay un gateway central de Xiaomi disponible en la red local, Home Assistant priorizará el envío de comandos de control de dispositivos a través del gateway central para lograr un control localizado. Si no hay un gateway central en la red local, intentará enviar comandos de control a través del protocolo Xiaomi OT para lograr un control localizado. Solo cuando no se cumplan las condiciones anteriores de control localizado, los comandos de control del dispositivo se enviarán a través de la nube.\r\n- Nube: Los comandos de control solo se envían a través de la nube.\r\n### Hogares de dispositivos importados\r\nLa integración agregará los dispositivos en los hogares seleccionados.\r\n&emsp;\r\n### ¡Hola, {nick_name}! Seleccione el modo de control de integración y el hogar donde se encuentran los dispositivos que desea agregar.\r\n",
                "data": {
                    "ctrl_mode": "Modo de control",
                    "home_infos": "Hogares de dispositivos importados"
                }
            },
            "update_trans_rules": {
                "title": "Actualizar reglas de conversión de entidad",
                "description": "## Instrucciones de uso\r\n- Actualice la información de la entidad de los dispositivos en la instancia de integración actual, incluida la configuración multilingüe de SPEC, la traducción booleana de SPEC y el filtrado de modelos de SPEC.\r\n- **Advertencia: Esta configuración es una configuración global** y actualizará directamente la caché local. Si hay dispositivos del mismo modelo en otras instancias de integración, las instancias relevantes también se actualizarán después de recargarlas.\r\n- Esta operación tomará algún tiempo, por favor sea paciente. Marque \"Confirmar actualización\" y haga clic en \"Siguiente\" para comenzar a actualizar **{urn_count}** reglas, de lo contrario, omita la actualización.\r\n",
                "data": {
                    "confirm": "Confirmar actualización"
                }
            },
            "update_lan_ctrl_config": {
                "title": "Actualizar configuración de control LAN",
                "description": "## Instrucciones de uso\r\nActualice la información de configuración para **control LAN de dispositivos Xiaomi Home**. Cuando la nube y la puerta de enlace central no puedan controlar los dispositivos, la integración intentará controlar los dispositivos a través de la LAN; si no se selecciona ninguna tarjeta de red, el control LAN no se habilitará.\r\n- Actualmente, solo se admiten dispositivos WiFi **SPEC v2** en la LAN. Algunos dispositivos más antiguos pueden no admitir el control o la sincronización de propiedades.\r\n- Seleccione la(s) tarjeta(s) de red en la misma red que los dispositivos (se admiten múltiples selecciones). Si la tarjeta de red seleccionada tiene dos o más conexiones en la misma red, se recomienda seleccionar la que tenga la mejor conexión de red, de lo contrario, puede **afectar el uso normal de los dispositivos**.\r\n- **Si hay dispositivos terminales (puertas de enlace, teléfonos móviles, etc.) en la LAN que admiten el control local, habilitar la suscripción LAN puede causar automatización local o anomalías en los dispositivos. Úselo con precaución**.\r\n- **Advertencia: Esta configuración es global y los cambios afectarán a otras instancias de integración. Modifique con precaución**.\r\n{notice_net_dup}\r\n",
                "data": {
                    "net_interfaces": "Por favor, seleccione la tarjeta de red a utilizar",
                    "enable_subscribe": "Habilitar suscripción LAN"
                }
            },
            "config_confirm": {
                "title": "Confirmar configuración",
                "description": "¡Hola, **{nick_name}**! Por favor, confirme la última información de configuración y haga clic en \"Enviar\" para finalizar la configuración.\r\nLa integración se volverá a cargar con la nueva configuración.\r\n\r\nIdioma de la integración:\t{lang_new}\r\nApodo de usuario:\t{nick_name_new}\r\nModo de depuración de Action:\t{action_debug}\r\nOcultar entidades generadas no estándar:\t{hide_non_standard_entities}\r\nCambios de dispositivos:\t{devices_add} dispositivos agregados, {devices_remove} dispositivos eliminados\r\nCambios en las reglas de conversión:\t{trans_rules_count} reglas en total, {trans_rules_count_success} reglas actualizadas\r\n",
                "data": {
                    "confirm": "Confirmar modificación"
                }
            }
        },
        "progress": {
            "oauth": "### {link_left}Haga clic aquí para iniciar sesión de nuevo{link_right}"
        },
        "error": {
            "not_auth": "Usuario no autenticado. Haga clic en el enlace de autenticación para autenticarse.",
            "get_token_error": "Error al obtener la información de autorización de inicio de sesión (token OAuth).",
            "get_homeinfo_error": "Error al obtener la información del hogar.",
            "get_cert_error": "Error al obtener el certificado de la puerta de enlace.",
            "no_family_selected": "No se ha seleccionado ningún hogar.",
            "no_devices": "No hay dispositivos en el hogar seleccionado. Seleccione un hogar con dispositivos y continúe.",
            "no_central_device": "【Modo de puerta de enlace central】Se requiere una puerta de enlace Xiaomi disponible en la red local donde se encuentra Home Assistant. Verifique si el hogar seleccionado cumple con este requisito.",
            "mdns_discovery_error": "Error en el servicio de descubrimiento de dispositivos locales.",
            "update_config_error": "Error al actualizar la información de configuración.",
            "not_confirm": "No se ha confirmado la opción de modificación. Seleccione y confirme la opción antes de enviar."
        },
        "abort": {
            "network_connect_error": "La configuración ha fallado. Existe un problema con la conexión de red, verifique la configuración de red del dispositivo.",
            "options_flow_error": "Error al reconfigurar la integración: {error}",
            "re_add": "Agregue la integración de nuevo, mensaje de error: {error}",
            "storage_error": "Error en el módulo de almacenamiento de integración. Intente de nuevo o agregue la integración de nuevo: {error}",
            "inconsistent_account": "La información de la cuenta no coincide. Inicie sesión con la cuenta correcta."
        }
    }
}